OdDAI.SelectType.setSelections(std.set&lt;OdDAI.NamedType!System.Runtime.CompilerServices.IsConst**,std.less&lt;OdDAI.NamedType!System.Runtime.CompilerServices.IsConst**&gt;,std.allocator&lt;OdDAI.NamedType!System.Runtime.CompilerServices.IsConst**&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a new set of selectable data types for the select data type.
\param selections [in] An STD set that contains th selectable data types to be set.